In [2]:
import pandas as pd
import numpy as np

In [3]:
movies = pd.read_csv("./data/movies.csv")
ratings = pd.read_csv("./data/ratings.csv")

# A. showing some data

## 5 first movies

In [7]:
movies.head(5)

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

# 5 last movies

In [8]:
movies.tail(5)

,movieId,title,genres
9737,193581,Black Butler: Book of the Atlantic (2017),Action|Animation|Comedy|Fantasy
9738,193583,No Game No Life: Zero (2017),Animation|Comedy|Fantasy
9739,193585,Flint (2017),Drama
9740,193587,Bungo Stray Dogs: Dead Apple (2018),Action|Animation
9741,193609,Andrew Dice Clay: Dice Rules (1991),Comedy

## 5 first ratings

In [9]:
ratings.head(5)

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

## 5 last ratings

In [10]:
ratings.tail(5)

        userId  movieId  rating   timestamp
100831     610   166534     4.0  1493848402
100832     610   168248     5.0  1493850091
100833     610   168250     5.0  1494273047
100834     610   168252     5.0  1493846352
100835     610   170875     3.0  1493846415

## movies dataset shape

In [11]:
movies.shape

(9742, 3)

## ratings dataset shape

In [12]:
ratings.shape

(100836, 4)

### create a colmun in movie dataset

# B. merge the two datasets

In [46]:
df = pd.merge(movies, ratings, on="movieId")

In [47]:
df.head()

,movieId,title,genres,userId,rating,timestamp
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,1,4.0,964982703
1,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,5,4.0,847434962
2,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,7,4.5,1106635946
3,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,15,2.5,1510577970
4,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,17,4.5,1305696483

In [48]:
df.shape

(100836, 6)

# C. Delete the extra rows

title, generes and timestamp seems to have no use looking forward

In [49]:
df = df.drop(columns=["title", "genres", "timestamp"])

# D. Group by `userId`

In [52]:
groups = df.groupby("userId")

# E. Normalize the ratings

In [57]:
from sklearn import preprocessing

In [67]:
df[["rating"]]

        rating
0          4.0
1          4.0
2          4.5
3          2.5
4          4.5
...        ...
100831     4.0
100832     3.5
100833     3.5
100834     3.5
100835     4.0

[100836 rows x 1 columns]

In [70]:
sclaer = preprocessing.StandardScaler()
train_x = sclaer.fit_transform(df[["rating"]])

In [71]:
train_x

array([[ 0.47811176],
       [ 0.47811176],
       [ 0.95771699],
       ...,
       [-0.00149347],
       [-0.00149347],
       [ 0.47811176]])